SanketHiremath/Lightweight-RTOS-TM4C123/main.c
}

void enableExceptionHandler(void)
{
    NVIC_SYS_HND_CTRL_R |= NVIC_SYS_HND_CTRL_USAGE;
    NVIC_SYS_HND_CTRL_R |= NVIC_SYS_HND_CTRL_BUS;
    NVIC_SYS_HND_CTRL_R |= NVIC_SYS_HND_CTRL_MEM;
}

// Turns ON the MPU
void enableMPU(void)
{
    NVIC_MPU_CTRL_R |= NVIC_MPU_CTRL_ENABLE;
//    NVIC_MPU_CTRL_R |= NVIC_MPU_CTRL_HFNMIENA;
}

void setBackgroundRule(void)
{

    NVIC_MPU_BASE_R = REGION0 | NVIC_MPU_BASE_VALID | 0x00000000;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_4GB) | NVIC_MPU_ATTR_BUFFRABLE | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_FULL_ACCESS;
}

void allowFlashAccess(void)
{
    NVIC_MPU_BASE_R = REGION1 | NVIC_MPU_BASE_VALID | 0x00000000;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(0x11) | NVIC_MPU_ATTR_CACHEABLE | AP_FULL_ACCESS;
}

//Not used as peripherals are covered by the background rule.
void allowPeripheralAccess(void)
{
    NVIC_MPU_BASE_R = REGION2 | NVIC_MPU_BASE_VALID | 0x4000000;

}

void setupSramAccess(void)
{
    // SRAM 8KiB block 0
    NVIC_MPU_BASE_R = REGION3 | NVIC_MPU_BASE_VALID | SRAM_REGION_BASE0;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_8KB) | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_RW_PRIVILEGED_ONLY;

    // SRAM 8KiB block 1
    NVIC_MPU_BASE_R = REGION4 | NVIC_MPU_BASE_VALID | SRAM_REGION_BASE1;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_8KB) | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_RW_PRIVILEGED_ONLY;

    // SRAM 8KiB block 2
    NVIC_MPU_BASE_R = REGION5 | NVIC_MPU_BASE_VALID | SRAM_REGION_BASE2;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_8KB) | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_RW_PRIVILEGED_ONLY;

    // SRAM 8KiB block 3
    NVIC_MPU_BASE_R = REGION6 | NVIC_MPU_BASE_VALID | SRAM_REGION_BASE3;
    NVIC_MPU_ATTR_R = NVIC_MPU_ATTR_ENABLE | REGION_SIZE(SIZE_8KB) | NVIC_MPU_ATTR_CACHEABLE | NVIC_MPU_ATTR_SHAREABLE | AP_RW_PRIVILEGED_ONLY;

}

// REQUIRED: initialize MPU here
void initMpu(void)
{
    // REQUIRED: call your MPU functions here
    enableExceptionHandler();                               // Enable all exception handling
    setBackgroundRule();                                    // Setting background rule for entire memory map.
    allowFlashAccess();                                     // Setting background rule for 256KiB flash.
    setupSramAccess();                                      // Dividing SRAM into 4 regions & setting access rules.
    enableMPU();


}

//-----------------------------------------------------------------------------
// RTOS Kernel Functions
//-----------------------------------------------------------------------------

// REQUIRED: initialize systick for 1ms system timer
void initRtos()
{
    uint8_t i;
    // no tasks running
    taskCount = 0;
    // clear out tcb records
    for (i = 0; i < MAX_TASKS; i++)
    {
        tcb[i].state = STATE_INVALID;
        tcb[i].pid = 0;
    }
}

// REQUIRED: Implement prioritization to 8 levels
int rtosScheduler()
{
    bool ok;
    static uint8_t task = 0xFF;
    ok = false;
    while (!ok)
    {
        task++;
        if (task >= MAX_TASKS)
            task = 0;
        ok = (tcb[task].state == STATE_READY || tcb[task].state == STATE_UNRUN);
    }
    return task;
}

bool createThread(_fn fn, const char name[], uint8_t priority, uint32_t stackBytes)
{
    uint8_t num;
    uint32_t subregionNum, bitMask;
    uint32_t* heap = (uint32_t*)0x20001400;
    uint32_t addr;
    uint32_t* tempAddr;
    static uint32_t prevSrdBits = 0;
//    uint32_t* brk = (uint32_t*)0x20007FFF;

    bool ok = false;
    uint8_t i = 0;
    bool found = false;
    // REQUIRED:
    // store the thread name
    copyString(name, tcb[i].name);
    // allocate stack space and store top of stack in sp and spInit

    // add task if room in task list
    if (taskCount < MAX_TASKS)
    {
        // make sure fn not already in list (prevent reentrancy)
        while (!found && (i < MAX_TASKS))
        {
            found = (tcb[i++].pid ==  fn);
        }
        if (!found)
        {
            num = (((stackBytes - 1) / 1024) + 1);

            // find first available tcb record
            i = 0;
            while (tcb[i].state != STATE_INVALID) {i++;}
            tcb[i].state = STATE_UNRUN;
            tcb[i].pid = fn;


             if (i == 0)
             {
                addr = (uint32_t)heap;
             }
             else
             {
                addr = (uint32_t)tcb[i-1].spInit;
                tempAddr = mallocFromHeap(1023);
                putsUart0("malloc= ");
                convertDec_Hex((uint32_t) tempAddr);
                putsUart0("\n\r");
             }

            // Calculating the SRD bits
            subregionNum = (addr - (0x20000000)) / 1024;  // Calculate no. of times to shift
            stackBytes = stackBytes / 1024;               // Calculate no. of bits to flip
            bitMask = (1 << stackBytes) - 1;              // Calculate the number of SRD bits to be high
            bitMask = (bitMask << subregionNum);          // Moving the bits to the correct subregion.
            prevSrdBits = prevSrdBits | bitMask;          // New bitmask is ORed with the previous bitmask.

            tcb[i].sp = (void*)(addr + (num * 1024));
            tcb[i].spInit = (void*)(addr + (num * 1024));

            putsUart0("spinit= ");
            convertDec_Hex((uint32_t) tcb[i].spInit);
            putsUart0("\n\r");

            tcb[i].priority = priority;
            tcb[i].srd = (prevSrdBits);

//            convertDec_Hex((uint32_t) tcb[i].srd);
//            putsUart0("\n\r");
            // increment task count
            taskCount++;
            ok = true;
        }
    }
    // REQUIRED: allow tasks switches again
    return ok;
}

// REQUIRED: modify this function to restart a thread
void restartThread(_fn fn)
{
}

// REQUIRED: modify this function to stop a thread
// REQUIRED: remove any pending semaphore waiting
// NOTE: see notes in class for strategies on whether stack is freed or not
void stopThread(_fn fn)
{
}

