SanketHiremath/Lightweight-RTOS-TM4C123/main.c
// REQUIRED: modify this function to set a thread priority
void setThreadPriority(_fn fn, uint8_t priority)
{
}

bool createSemaphore(uint8_t semaphore, uint8_t count)
{
    bool ok = (semaphore < MAX_SEMAPHORES);
    {
        semaphores[semaphore].count = count;
    }
    return ok;
}

// REQUIRED: modify this function to start the operating system
// by calling scheduler, setting PSP, ASP bit, TMPL bit, and PC
void startRtos()
{
    // Calling the RTOS scheduler to get the current task running.
    taskCurrent = (uint8_t)rtosScheduler();

    // Setting the stack pointer to the stack space of the process
    // and setting the ASP bit.
    setPSP((uint32_t)tcb[taskCurrent].sp);
    enablePSPMode();

    // Setting the process id of the current task to the function pointer.
    _fn fn = (_fn)tcb[taskCurrent].pid;
    tcb[taskCurrent].state = STATE_READY;

//    setSRAMBits(tcb[taskCurrent].srd);
    setSRAMBits(0xFFFFFFFF);
    convertDec_Hex((uint32_t) tcb[taskCurrent].srd);
    putsUart0("\n\r");

    // Turning on the TMPL bit and calling the function
    disablePrivileged();
    fn();
}

// REQUIRED: modify this function to yield execution back to scheduler using pendsv
void yield()
{
    putcUart0('y');
    __asm(" SVC  #10");

}

// REQUIRED: modify this function to support 1ms system timer
// execution yielded back to scheduler until time elapses using pendsv
void sleep(uint32_t tick)
{
}

// REQUIRED: modify this function to wait a semaphore using pendsv
void wait(int8_t semaphore)
{
}

// REQUIRED: modify this function to signal a semaphore is available using pendsv
void post(int8_t semaphore)
{
}

// REQUIRED: modify this function to add support for the system timer
// REQUIRED: in preemptive code, add code to request task switch
void systickIsr()
{
}

// REQUIRED: in coop and preemptive, modify this function to add support for task switching
// REQUIRED: process UNRUN and READY tasks differently
void pendSvIsr()
{

    putcUart0('p');

    pushStack();
    tcb[taskCurrent].sp = (void*)getPsp();
    // calling the scheduler
    taskCurrent = (uint8_t)rtosScheduler();
    tcb[taskCurrent].state = STATE_READY;
    setSRAMBits(tcb[taskCurrent].srd);
    setPSP((uint32_t)tcb[taskCurrent].sp);
    popStack();

/*
    pushStack();
    tcb[taskCurrent].sp = (void*)getPsp();
    taskCurrent = (uint8_t)rtosScheduler();

    setSRAMBits(tcb[taskCurrent].srd);

    if(tcb[taskCurrent].state == STATE_READY)
    {
        setPSP((uint32_t)tcb[taskCurrent].sp);  // Put into PSP the task current to switch task
        popStack();                             // Pop R4 - R11
    }

    else
    {
        tcb[taskCurrent].state = STATE_READY;
        setPSP((uint32_t)tcb[taskCurrent].spInit);  // Point the sp to the sp of the task
        pushPsp(0x61000000);                        // xPSR
        pushPsp((uint32_t)tcb[taskCurrent].pid);    // PC
        pushPsp(0xFFFFFFFD);                        // LR
        pushPsp(0x00);                              // R12
        pushPsp(0x00);                              // R3
        pushPsp(0x00);                              // R2
        pushPsp(0x00);                              // R1
        pushPsp(0x00);                              // R0
    }
*/

}

// REQUIRED: modify this function to add support for the service call
// REQUIRED: in preemptive code, add code to handle synchronization primitives
void svCallIsr()
{
    putcUart0('s');
    NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;
}

// REQUIRED: code this function
void mpuFaultIsr()
{
    uint32_t* address1;
    uint32_t* address2;

    putsUart0("MPU fault occured\n\r");


    // Print MSP and PSP
    putsUart0("MSP = 0x");
    address1 = getMsp();
    convertDec_Hex((uint32_t)address1);
    putsUart0("\r\n");

    putsUart0("PSP = 0x");
    address2 = getPsp();
    convertDec_Hex((uint32_t)address2);
    putsUart0("\r\n");

    putsUart0("mFault Flags = 0x");
    convertDec_Hex(NVIC_FAULT_STAT_R & 0xFF);
    putsUart0("\r\n");


    // Printing the reg r0-r3, r12...
     uint32_t *stackdump;
     stackdump = getPsp();

    putsUart0("R0 = 0x");
    convertDec_Hex(*(stackdump));
    putsUart0("\r\n");

    putsUart0("R1 = 0x");
    convertDec_Hex(*(stackdump + 1));
    putsUart0("\r\n");

    putsUart0("R2 = 0x");
    convertDec_Hex(*(stackdump + 2));
    putsUart0("\r\n");

    putsUart0("R3 = 0x");
    convertDec_Hex(*(stackdump + 3));
    putsUart0("\r\n");

    putsUart0("R12 = 0x");
    convertDec_Hex(*(stackdump + 4));
    putsUart0("\r\n");

    putsUart0("LR = 0x");
    convertDec_Hex(*(stackdump + 5));
    putsUart0("\r\n");

    putsUart0("PC = 0x");
    convertDec_Hex(*(stackdump + 6));
    putsUart0("\r\n");

    putsUart0("xPSR = 0x");
    convertDec_Hex(*(stackdump + 7));
    putsUart0("\r\n");
    putsUart0("-------------------------------------------------------\n\r");

    // Clearing the MPU fault
    NVIC_SYS_HND_CTRL_R &= ~NVIC_SYS_HND_CTRL_MEMP;

    // Triggering a PendSV ISR
    NVIC_INT_CTRL_R |= NVIC_INT_CTRL_PEND_SV;
}

// REQUIRED: code this function
void hardFaultIsr()
{
    uint32_t* address1;
    uint32_t* address2;
    uint32_t test2;

    putsUart0("hard fault occured\n\r");

    // Print MSP and PSP
    putsUart0("MSP = 0x");
    address1 = getMsp();
    convertDec_Hex((uint32_t)address1);
    putsUart0("\r\n");

    putsUart0("PSP = 0x");
    address2 = getPsp();
    convertDec_Hex((uint32_t)address2);
    putsUart0("\r\n");

    putsUart0("Hard Fault Flags = 0x");
    test2 = (NVIC_HFAULT_STAT_R & 0xFF);
    convertDec_Hex(test2);

    putsUart0("\r\n");
    putsUart0("-------------------------------------------------------\n\r");
}

// REQUIRED: code this function
void busFaultIsr()
{
    putsUart0("bus fault occured\n\r");
    putsUart0("-------------------------------------------------------\n\r");
}

// REQUIRED: code this function
void usageFaultIsr()
{
    putsUart0("usage fault occured\n\r");
    putsUart0("-------------------------------------------------------\n\r");
}

